
nc: 80  # number of classes
scales:   # [depth, width, max_channels]
  T: [0.33, 0.25, 1024]  #Mamba-YOLOv8-T summary: 6.1M parameters,   14.3GFLOPs


# Mamba-YOLO backbone 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [64, 3]]   # 0-P2/4       3->128
  - [-1, 3, MSGDC, [16]]               # 1      128->128
  # - [-1, 3, VSSBlock, [128]]               # 1      128->128

  - [-1, 1, VisionClueMerge, [128]]      # 2 p3/8    128->256
  - [-1, 3, MSGDC, [32]]              # 3        256->256
  # - [-1, 3, VSSBlock, [256]]               # 1      128->128

  - [-1, 1, VisionClueMerge, [256]]      # 4 p4/16   256->512
  # - [-1, 9, MSGDC, [128]]  
  - [-1, 9, VSSBlock, [256]]    
  - [-1, 1, VisionClueMerge, [512]]      # 6 p5/32   521->1024
  # - [-1, 3, MSGDC, [256]]                  
  - [-1, 3, VSSBlock, [512]]                  
  - [-1, 1, SPPF, [512, 5]]               # 8        1024->1024

# Mamba-YOLO PAFPN
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        #1024->1024
  - [[-1, 5], 1, RCSSC_Concat, [1]]  # cat backbone P4     # 1024+512->1536
  - [-1, 3, XSSBlock, [512]]  # 11                    1526->512

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]         #512->512
  - [[-1, 3], 1, RCSSC_Concat, [1]]  # cat backbone P3 
  - [-1, 3, XSSBlock, [256]]  # 14 (P3/8-small)         768->256

  - [-1, 1, Conv, [256, 3, 2]]                        # 256->256
  - [[-1, 11], 1, RCSSC_Concat, [1]]  # cat head P4           256+ 512->768
  - [-1, 3, XSSBlock, [512]]  # 17 (P4/16-medium)       768->512

  - [-1, 1, Conv, [512, 3, 2]]                          # 512->512
  - [[-1, 8], 1, RCSSC_Concat, [1]]  # cat head P5              512+1024->1536
  - [-1, 3, XSSBlock, [1024]]  # 20 (P5/32-large)         1536->1024

  # - [0, 1, DWConv, [256, 3, 1]]  # 21 使用深度可分离卷积增强特征
  # - [21, 1, Conv, [256, 1, 1]]  # 22 从 P2/4 特征图开始，使用 1x1 卷积调整通道数


  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)    256,512,1024
